doc/Fractionals_in_other_Blockchains.org
* Fractionals in other blockchains
The status of the following notes is from 2019-07 if not otherwise noted. The notes are mostly about keywords searched for in the repositories.
** Etherum
*** 19-07-23: https://solidity.readthedocs.io/en/develop/types.html#fixed-point-numbers
**** "Fixed point numbers are not fully supported by Solidity yet. They can be declared, but cannot be assigned to or from." (still the same 2019-10-22)
***** Searched source code on github, also only placeholders / "unimplemented" assertions: https://github.com/ethereum/solidity/search?p=2&q=fixed+point&unscoped_q=fixed+point
**** Has number literal types with decimal fractional literals, also with scientific notations, e.g. 2.5e1
***** Number literal expressions are converted into a non-literal type as soon as they are used with non-literal expressions.
***** Number literal expressions retain arbitrary precision
****** "Number literal expressions retain arbitrary precision until they are converted to a non-literal type (i.e. by using them together with a non-literal expression or by explicit conversion). This means that computations do not overflow and divisions do not truncate in number literal expressions."
****** So probably literal operations are symbolic; ("division on literals results in fractional values of arbitrary precision")
******* Because otherwise "1/3" could not be represented with arbitrary precision...
****** Can even do "(2**800 + 1) - 2**800"
** Tezos
*** Repository https://gitlab.com/tezos/tezos
**** "Fractional": only ocaml conversion functions from float to int...
**** "Floating point": nothing
**** "Fixed point": nothing
** Dfinity
*** Repositories: https://github.com/dfinity
**** Not much for: Fractionals, floating, fixed point
**** winter
***** Only listing of operations on floats as haskell datatypes: https://github.com/dfinity/winter/blob/1cea7652f48fad348af914cb6a56b39f8dd99c6a/src/Wasm/Syntax/Ops/Float.hs and conversion
***** And implementation using haskell operations, no sin etc. https://github.com/dfinity/winter/blob/1cea7652f48fad348af914cb6a56b39f8dd99c6a/src/Wasm/Exec/EvalNumeric.hs
**** Haskell to webassembly compiler: https://github.com/dfinity/dhc
***** No float operations supported
**** Haskell port of the WebAssembly OCaml interpreter: https://github.com/dfinity/winter (https://github.com/WebAssembly/spec/tree/master/interpreter)
** Cordano (https://www.cardano.org/en/home/)
*** Repository (link from website): https://github.com/input-output-hk/cardano-sl/
*** Nothing for: Floating point, fixed point, fractionals
** Corda
*** Keywords: Floating point, fixed point, fractionals
*** Non-determinism in JVM https://github.com/corda/corda/blob/aa75157273dc12d7f5183873780bacd35360eb5f/docs/source/key-concepts-djvm.rst#id3
**** They want a deterministic JVM: https://docs.corda.net/key-concepts-djvm.html
**** What they do: "Sets the strictfp flag on all methods, which requires the JVM to do floating point arithmetic in a hardware independent fashion. Whilst we anticipate that floating point arithmetic is unlikely to feature in most smart contracts (big integer and big decimal libraries are available), it is available for those who want to use it." (https://github.com/corda/corda/blob/aa75157273dc12d7f5183873780bacd35360eb5f/docs/source/key-concepts-djvm.rst#always-use-strict-floating-point-arithmetic)
***** strictfp modified for classes/methods etc. (but does not bring us much further): https://en.wikipedia.org/wiki/Strictfp_
***** So how does the JVM do it?
** zCash: https://github.com/zcash
*** Not really anything relevant for: Floating point, fixed point, fractionals
** Ziliqa (19-08-06)
*** Repository: https://github.com/Zilliqa/Zilliqa
*** Nothing for: fractional, floating point, fixed point
